FreeRTOS/FreeRTOS/FreeRTOS-Plus/Source/FreeRTOS-Plus-TCP/portable/NetworkInterface/STM32Hxx/stm32hxx_hal_eth.c
      (+) Call the function HAL_ETH_DeInit() to restore the default configuration
          of the selected ETH peripheral.

@endverbatim
  * @{
  */

/**
  * @brief  Initialize the Ethernet peripheral registers.
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ETH_Init(ETH_HandleTypeDef *heth)
{
	uint32_t tickstart;

	if(heth == NULL)
	{
		return HAL_ERROR;
	}

#if (USE_HAL_ETH_REGISTER_CALLBACKS == 1)

	if(heth->gState == HAL_ETH_STATE_RESET)
	{
		/* Allocate lock resource and initialize it */
		heth->Lock = HAL_UNLOCKED;

		ETH_InitCallbacksToDefault(heth);

		if(heth->MspInitCallback == NULL)
		{
			heth->MspInitCallback = HAL_ETH_MspInit;
		}

		/* Init the low level hardware */
		heth->MspInitCallback(heth);
	}

#else

	/* Check the ETH peripheral state */
	if(heth->gState == HAL_ETH_STATE_RESET)
	{
	/* Init the low level hardware : GPIO, CLOCK, NVIC. */
		HAL_ETH_MspInit(heth);
	}
#endif /* (USE_HAL_ETH_REGISTER_CALLBACKS) */

	heth->gState = HAL_ETH_STATE_BUSY;

	__HAL_RCC_SYSCFG_CLK_ENABLE();

	if(heth->Init.MediaInterface == HAL_ETH_MII_MODE)
	{
		HAL_SYSCFG_ETHInterfaceSelect(SYSCFG_ETH_MII);
	}
	else
	{
		HAL_SYSCFG_ETHInterfaceSelect(SYSCFG_ETH_RMII);
	}

	/* Ethernet Software reset */
	/* Set the SWR bit: resets all MAC subsystem internal registers and logic */
	/* After reset all the registers holds their respective reset values */
	SET_BIT(heth->Instance->DMAMR, ETH_DMAMR_SWR);

	/* Get tick */
	tickstart = HAL_GetTick();

	/* Wait for software reset */
	while (READ_BIT(heth->Instance->DMAMR, ETH_DMAMR_SWR) > 0U)
	{
		if(((HAL_GetTick() - tickstart ) > ETH_SWRESET_TIMEOUT))
		{
			/* Set Error Code */
			heth->ErrorCode = HAL_ETH_ERROR_TIMEOUT;
			/* Set State as Error */
			set_error_state(heth, HAL_ETH_STATE_ERROR);
			/* Return Error */
			return HAL_ERROR;
		}
	}

	/*------------------ MDIO CSR Clock Range Configuration --------------------*/
	ETH_MAC_MDIO_ClkConfig(heth);

	/*------------------ MAC LPI 1US Tic Counter Configuration --------------------*/
	WRITE_REG(heth->Instance->MAC1USTCR, (((uint32_t)HAL_RCC_GetHCLKFreq() / ETH_MAC_US_TICK) - 1U));

	/*------------------ MAC, MTL and DMA default Configuration ----------------*/
	ETH_MACDMAConfig(heth);

	/* SET DSL to 64 bit */
	MODIFY_REG(heth->Instance->DMACCR, ETH_DMACCR_DSL, ETH_DMACCR_DSL_64BIT);

	/* Set Receive Buffers Length (must be a multiple of 4) */
	if ((heth->Init.RxBuffLen % 0x4U) != 0x0U)
	{
		/* Set Error Code */
		heth->ErrorCode = HAL_ETH_ERROR_PARAM;
		/* Set State as Error */
		set_error_state(heth, HAL_ETH_STATE_ERROR);
		/* Return Error */
		return HAL_ERROR;
	}
	else
	{
		MODIFY_REG(heth->Instance->DMACRCR, ETH_DMACRCR_RBSZ, ((heth->Init.RxBuffLen) << 1));
	}

	/*------------------ DMA Tx Descriptors Configuration ----------------------*/
	ETH_DMATxDescListInit(heth);

	/*------------------ DMA Rx Descriptors Configuration ----------------------*/
	ETH_DMARxDescListInit(heth);

	/*--------------------- ETHERNET MAC Address Configuration ------------------*/
	/* Set MAC addr bits 32 to 47 */
	heth->Instance->MACA0HR = (((uint32_t)(heth->Init.MACAddr[5]) << 8) | (uint32_t)heth->Init.MACAddr[4]);
	/* Set MAC addr bits 0 to 31 */
	heth->Instance->MACA0LR = (((uint32_t)(heth->Init.MACAddr[3]) << 24) | ((uint32_t)(heth->Init.MACAddr[2]) << 16) |
	((uint32_t)(heth->Init.MACAddr[1]) << 8) | (uint32_t)heth->Init.MACAddr[0]);

	heth->ErrorCode = HAL_ETH_ERROR_NONE;
	heth->gState = HAL_ETH_STATE_READY;
	heth->RxState = HAL_ETH_STATE_READY;

	return HAL_OK;
}

///**
//* @brief  DeInitializes the ETH peripheral.
//* @param  heth: pointer to a ETH_HandleTypeDef structure that contains
//*         the configuration information for ETHERNET module
//* @retval HAL status
//*/
//HAL_StatusTypeDef HAL_ETH_DeInit(ETH_HandleTypeDef *heth)
//{
///* Set the ETH peripheral state to BUSY */
//heth->gState = HAL_ETH_STATE_BUSY;
//
//#if (USE_HAL_ETH_REGISTER_CALLBACKS == 1)
//
//if(heth->MspDeInitCallback == NULL)
//{
//heth->MspDeInitCallback = HAL_ETH_MspDeInit;
//}
///* DeInit the low level hardware */
//heth->MspDeInitCallback(heth);
//#else
//
///* De-Init the low level hardware : GPIO, CLOCK, NVIC. */
//HAL_ETH_MspDeInit(heth);
//
//#endif /* (USE_HAL_ETH_REGISTER_CALLBACKS) */
//
///* Set ETH HAL state to Disabled */
//heth->gState= HAL_ETH_STATE_RESET;
//
///* Return function status */
//return HAL_OK;
//}

/**
  * @brief  Initializes the ETH MSP.
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @retval None
  */
__weak void HAL_ETH_MspInit(ETH_HandleTypeDef *heth)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(heth);
  /* NOTE : This function Should not be modified, when the callback is needed,
  the HAL_ETH_MspInit could be implemented in the user file
  */
}

/**
  * @brief  DeInitializes ETH MSP.
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @retval None
  */
__weak void HAL_ETH_MspDeInit(ETH_HandleTypeDef *heth)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(heth);
  /* NOTE : This function Should not be modified, when the callback is needed,
  the HAL_ETH_MspDeInit could be implemented in the user file
  */
}

#if (USE_HAL_ETH_REGISTER_CALLBACKS == 1)
/**
  * @brief  Register a User ETH Callback
  *         To be used instead of the weak predefined callback
  * @param heth eth handle
  * @param CallbackID ID of the callback to be registered
  *        This parameter can be one of the following values:
  *          @arg @ref HAL_ETH_TX_COMPLETE_CB_ID Tx Complete Callback ID
  *          @arg @ref HAL_ETH_RX_COMPLETE_CB_ID Rx Complete Callback ID
  *          @arg @ref HAL_ETH_DMA_ERROR_CB_ID   DMA Error Callback ID
  *          @arg @ref HAL_ETH_MAC_ERROR_CB_ID   MAC Error Callback ID
  *          @arg @ref HAL_ETH_PMT_CB_ID         Power Management Callback ID
  *          @arg @ref HAL_ETH_EEE_CB_ID         EEE Callback ID
  *          @arg @ref HAL_ETH_WAKEUP_CB_ID      Wake UP Callback ID
  *          @arg @ref HAL_ETH_MSPINIT_CB_ID     MspInit callback ID
  *          @arg @ref HAL_ETH_MSPDEINIT_CB_ID   MspDeInit callback ID
  * @param pCallback pointer to the Callback function
  * @retval status
  */
HAL_StatusTypeDef HAL_ETH_RegisterCallback(ETH_HandleTypeDef *heth, HAL_ETH_CallbackIDTypeDef CallbackID, pETH_CallbackTypeDef pCallback)
{
  HAL_StatusTypeDef status = HAL_OK;

