FreeRTOS/FreeRTOS/FreeRTOS-Plus/Source/FreeRTOS-Plus-TCP/portable/NetworkInterface/STM32Hxx/stm32hxx_hal_eth.c
/*  Not used for FreeRTOS+TCP */
//	if(pBuffer2 != NULL)
//	{
//		/* write buffer 2 address to RDES1 */
//		WRITE_REG(dmarxdesc->DESC2, (uint32_t)pBuffer2);
//		/* store buffer 2 address */
//		WRITE_REG(dmarxdesc->BackupAddr1, (uint32_t)pBuffer2);
//		/* set buffer 2 address valid bit to RDES3 */
//		SET_BIT(dmarxdesc->DESC3, ETH_DMARXNDESCRF_BUF2V);
//	}

	/* set OWN bit to RDES3 */
	SET_BIT(dmarxdesc->DESC3, ETH_DMARXNDESCRF_OWN);
	( void ) dmarxdesc->DESC3;

	return HAL_OK;
}

/**
  * @}
  */

/** @defgroup ETH_Exported_Functions_Group2 IO operation functions
  *  @brief ETH Transmit and Receive functions
  *
@verbatim
  ==============================================================================
                      ##### IO operation functions #####
  ==============================================================================
  [..]
    This subsection provides a set of functions allowing to manage the ETH
    data transfer.

@endverbatim
  * @{
  */

/**
  * @brief  Enables Ethernet MAC and DMA reception and transmission
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ETH_Start(ETH_HandleTypeDef *heth)
{
  if(heth->gState == HAL_ETH_STATE_READY)
  {
    heth->gState = HAL_ETH_STATE_BUSY;

  /* Enable the MAC transmission */
  SET_BIT(heth->Instance->MACCR, ETH_MACCR_TE);

  /* Enable the MAC reception */
  SET_BIT(heth->Instance->MACCR, ETH_MACCR_RE);

  /* Set the Flush Transmit FIFO bit */
  SET_BIT(heth->Instance->MTLTQOMR, ETH_MTLTQOMR_FTQ);

  /* Enable the DMA transmission */
  SET_BIT(heth->Instance->DMACTCR, ETH_DMACTCR_ST);

  /* Enable the DMA reception */
  SET_BIT(heth->Instance->DMACRCR, ETH_DMACRCR_SR);

    /* Clear Tx and Rx process stopped flags */
    heth->Instance->DMACSR |= (ETH_DMACSR_TPS | ETH_DMACSR_RPS);

    heth->gState = HAL_ETH_STATE_READY;
    heth->RxState = HAL_ETH_STATE_BUSY_RX;

    return HAL_OK;
  }
  else
  {
    return HAL_ERROR;
  }
}

/**
  * @brief  Enables Ethernet MAC and DMA reception/transmission in Interrupt mode
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ETH_Start_IT(ETH_HandleTypeDef *heth)
{
	uint32_t desc_index;

	if(heth->gState == HAL_ETH_STATE_READY)
	{
		heth->gState = HAL_ETH_STATE_BUSY;

		/* Set IOC bit (Interrupt Enabled on Completion) to all Rx descriptors */
		for( desc_index = 0; desc_index < ( uint32_t ) ETH_RX_DESC_CNT; desc_index++ )
		{
		ETH_DMADescTypeDef *dma_rx_desc;

			dma_rx_desc = (ETH_DMADescTypeDef *)heth->RxDescList.RxDesc[ desc_index ];
			SET_BIT(dma_rx_desc->DESC3, ETH_DMARXNDESCRF_IOC);
		}

		/* save IT mode to ETH Handle */
		heth->RxDescList.ItMode = 1U;

		/* Enable the MAC transmission */
		SET_BIT(heth->Instance->MACCR, ETH_MACCR_TE);

		/* Enable the MAC reception */
		SET_BIT(heth->Instance->MACCR, ETH_MACCR_RE);

		/* Set the Flush Transmit FIFO bit */
		SET_BIT(heth->Instance->MTLTQOMR, ETH_MTLTQOMR_FTQ);

		/* Enable the DMA transmission */
		SET_BIT(heth->Instance->DMACTCR, ETH_DMACTCR_ST);

		/* Enable the DMA reception */
		SET_BIT(heth->Instance->DMACRCR, ETH_DMACRCR_SR);

		/* Clear Tx and Rx process stopped flags */
		heth->Instance->DMACSR |= (ETH_DMACSR_TPS | ETH_DMACSR_RPS);

		/* Enable ETH DMA interrupts:
		- Tx complete interrupt
		- Rx complete interrupt
		- Fatal bus interrupt
		*/
		__HAL_ETH_DMA_ENABLE_IT(heth,
			ETH_DMACIER_NIE |	/* Normal Interrupt Summary Enable */
			ETH_DMACIER_RIE |	/* Receive Interrupt Enable */
			ETH_DMACIER_TIE |	/* Transmit Interrupt Enable */
			ETH_DMACIER_FBEE |	/* Fatal Bus Error Enable */
			ETH_DMACIER_AIE );	/* Abnormal Interrupt Summary Enable */

		heth->gState = HAL_ETH_STATE_READY;
		heth->RxState = HAL_ETH_STATE_BUSY_RX;

		return HAL_OK;
	}
	else
	{
		return HAL_ERROR;
	}
}

/**
  * @brief  Stop Ethernet MAC and DMA reception/transmission
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ETH_Stop(ETH_HandleTypeDef *heth)
{
  if(heth->gState != HAL_ETH_STATE_RESET)
{
     /* Set the ETH peripheral state to BUSY */
    heth->gState = HAL_ETH_STATE_BUSY;

  /* Disable the DMA transmission */
  CLEAR_BIT(heth->Instance->DMACTCR, ETH_DMACTCR_ST);

  /* Disable the DMA reception */
  CLEAR_BIT(heth->Instance->DMACRCR, ETH_DMACRCR_SR);

  /* Disable the MAC reception */
  CLEAR_BIT( heth->Instance->MACCR, ETH_MACCR_RE);

  /* Set the Flush Transmit FIFO bit */
  SET_BIT(heth->Instance->MTLTQOMR, ETH_MTLTQOMR_FTQ);

  /* Disable the MAC transmission */
  CLEAR_BIT(heth->Instance->MACCR, ETH_MACCR_TE);

    heth->gState = HAL_ETH_STATE_READY;
    heth->RxState = HAL_ETH_STATE_READY;

    /* Return function status */
    return HAL_OK;
  }
  else
  {
    return HAL_ERROR;
  }
}

/**
  * @brief  Stop Ethernet MAC and DMA reception/transmission in Interrupt mode
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ETH_Stop_IT(ETH_HandleTypeDef *heth)
{
  ETH_DMADescTypeDef *dmarxdesc;
  uint32_t descindex;

  if(heth->gState != HAL_ETH_STATE_RESET)
  {
    /* Set the ETH peripheral state to BUSY */
    heth->gState = HAL_ETH_STATE_BUSY;

    /* Disable intrrupts:
    - Tx complete interrupt
    - Rx complete interrupt
    - Fatal bus interrupt
    */
    __HAL_ETH_DMA_DISABLE_IT(heth, (ETH_DMACIER_NIE | ETH_DMACIER_RIE | ETH_DMACIER_TIE  |
                                   ETH_DMACIER_FBEE | ETH_DMACIER_AIE));

    /* Disable the DMA transmission */
    CLEAR_BIT(heth->Instance->DMACTCR, ETH_DMACTCR_ST);

    /* Disable the DMA reception */
    CLEAR_BIT(heth->Instance->DMACRCR, ETH_DMACRCR_SR);

    /* Disable the MAC reception */
    CLEAR_BIT( heth->Instance->MACCR, ETH_MACCR_RE);

