FreeRTOS/FreeRTOS/FreeRTOS-Plus/Source/FreeRTOS-Plus-TCP/portable/NetworkInterface/STM32Hxx/stm32hxx_hal_eth.c
    /* Set the Flush Transmit FIFO bit */
    SET_BIT(heth->Instance->MTLTQOMR, ETH_MTLTQOMR_FTQ);

    /* Disable the MAC transmission */
    CLEAR_BIT(heth->Instance->MACCR, ETH_MACCR_TE);

    /* Clear IOC bit (Interrupt Enabled on Completion) to all Rx descriptors */
    for(descindex = 0; descindex < (uint32_t)ETH_RX_DESC_CNT; descindex++)
    {
      dmarxdesc = (ETH_DMADescTypeDef *)heth->RxDescList.RxDesc[descindex];
      CLEAR_BIT(dmarxdesc->DESC3, ETH_DMARXNDESCRF_IOC);
    }

    heth->RxDescList.ItMode = 0U;

    heth->gState = HAL_ETH_STATE_READY;
    heth->RxState = HAL_ETH_STATE_READY;

    /* Return function status */
    return HAL_OK;
  }
  else
  {
    return HAL_ERROR;
  }
}

/**
  * @brief  Sends an Ethernet Packet in polling mode.
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @param  pTxConfig: Hold the configuration of packet to be transmitted
  * @param  Timeout: timeout value
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ETH_Transmit(ETH_HandleTypeDef *heth, ETH_TxPacketConfig *pTxConfig, uint32_t Timeout)
{
	uint32_t tickstart;
	const ETH_DMADescTypeDef *dmatxdesc;

	if(pTxConfig == NULL)
	{
		heth->ErrorCode |= HAL_ETH_ERROR_PARAM;
		return HAL_ERROR;
	}

	if(heth->gState == HAL_ETH_STATE_READY)
	{
		/* Config DMA Tx descriptor by Tx Packet info */
		if (ETH_Prepare_Tx_Descriptors(heth, pTxConfig, 0) != HAL_ETH_ERROR_NONE)
		{
			/* Set the ETH error code */
			heth->ErrorCode |= HAL_ETH_ERROR_BUSY;
			return HAL_ERROR;
		}

		dmatxdesc = (ETH_DMADescTypeDef *)(&heth->TxDescList)->TxDesc[heth->TxDescList.CurTxDesc];

		/* Incr current tx desc index */
		INCR_TX_DESC_INDEX(heth->TxDescList.CurTxDesc, 1U);

		/* Start transmission */
		/* issue a poll command to Tx DMA by writing address of next immediate free descriptor */
		WRITE_REG(heth->Instance->DMACTDTPR, (uint32_t)(heth->TxDescList.TxDesc[heth->TxDescList.CurTxDesc]));

		READ_REG( heth->Instance->DMACTDTPR );

		tickstart = HAL_GetTick();

		/* Wait for data to be transmitted or timeout occured */
		while((dmatxdesc->DESC3 & ETH_DMATXNDESCWBF_OWN) != (uint32_t)RESET)
		{
			if((heth->Instance->DMACSR & ETH_DMACSR_FBE) != (uint32_t)RESET)
			{
				heth->ErrorCode |= HAL_ETH_ERROR_DMA;
				heth->DMAErrorCode = heth->Instance->DMACSR;
				/* Set ETH HAL State to Ready */
				set_error_state(heth, HAL_ETH_STATE_ERROR);
				/* Return function status */
				return HAL_ERROR;
			}

			/* Check for the Timeout */
			if(Timeout != HAL_MAX_DELAY)
			{
				if(((HAL_GetTick() - tickstart ) > Timeout) || (Timeout == 0U))
				{
					heth->ErrorCode |= HAL_ETH_ERROR_TIMEOUT;
					set_error_state(heth, HAL_ETH_STATE_ERROR);
					return HAL_ERROR;
				}
			}
		}

		/* Return function status */
		return HAL_OK;
	}
	else
	{
		return HAL_ERROR;
	}
}

/**
  * @brief  Sends an Ethernet Packet in interrupt mode.
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @param  pTxConfig: Hold the configuration of packet to be transmitted
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ETH_Transmit_IT(ETH_HandleTypeDef *heth, ETH_TxPacketConfig *pTxConfig)
{
	if(pTxConfig == NULL)
	{
		heth->ErrorCode |= HAL_ETH_ERROR_PARAM;
		return HAL_ERROR;
	}

	if(heth->gState == HAL_ETH_STATE_READY)
	{
		/* Config DMA Tx descriptor by Tx Packet info */
		if( ETH_Prepare_Tx_Descriptors( heth, pTxConfig, 1 ) != HAL_ETH_ERROR_NONE )
		{
			heth->ErrorCode |= HAL_ETH_ERROR_BUSY;
			return HAL_ERROR;
		}

		/* Incr current tx desc index */
		INCR_TX_DESC_INDEX(heth->TxDescList.CurTxDesc, 1U);

		/*
		 * Start transmission.
		 * issue a poll command to Tx DMA by writing address of next immediate free descriptor.
		 * DMACTDTPR: "Channel Tx descriptor tail pointer register (ETH_DMACTXDTPR)
		 * The hardware tries to transmit all packets referenced by the 
		 * descriptors between the head and the tail pointer registers.
		 */

		WRITE_REG(heth->Instance->DMACTDTPR, ( uint32_t ) ( heth->TxDescList.TxDesc[ heth->TxDescList.CurTxDesc ] ) );
		/* Memory barrier. */
		__DSB();
		/* Read-back the value just written. */
		( void ) heth->Instance->DMACTDTPR;

		return HAL_OK;

	}
	else
	{
		return HAL_ERROR;
	}
}

/**
  * @brief  Checks for received Packets.
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @retval  1: A Packet is received
  *          0: no Packet received
  */
uint8_t HAL_ETH_IsRxDataAvailable(ETH_HandleTypeDef *heth)
{
	ETH_RxDescListTypeDef *dmarxdesclist = &heth->RxDescList;
	uint32_t desc_index = dmarxdesclist->CurRxDesc;
	ETH_DMADescTypeDef *dmarxdesc = (ETH_DMADescTypeDef *)dmarxdesclist->RxDesc[ desc_index ];
	uint32_t desc_scan_count = 0;
	uint32_t app_desc_count = 0;		/* Number of descriptors in received packet. */
	uint32_t first_app_desc_index = 0;	/* Index of the first descriptor of received packet.. */

	/* Check if descriptor is not owned by DMA */
	while( ( READ_BIT(dmarxdesc->DESC3, ETH_DMARXNDESCWBF_OWN ) == ( uint32_t ) RESET ) &&
		   ( desc_scan_count < ( uint32_t ) ETH_RX_DESC_CNT ) )
	{
		uint32_t ulDesc3 = dmarxdesc->DESC3;
		desc_scan_count++;

		/* FreeRTOS+TCP only handles packets that fit in 1 descriptor. */
		configASSERT( ( ( ulDesc3 & ETH_DMATXNDESCWBF_FD ) != 0U ) && ( ( ulDesc3 & ETH_DMATXNDESCWBF_LD ) != 0U ) );

		/* Check if last descriptor */
		if(READ_BIT(ulDesc3, ETH_DMARXNDESCWBF_LD) != (uint32_t)RESET)
		{
			/* Increment the number of descriptors to be passed to the application */
			app_desc_count += 1U;

			if(app_desc_count == 1U)
			{
				first_app_desc_index = desc_index;
			}

			/* Increment current rx descriptor index */
			INCR_RX_DESC_INDEX(desc_index, 1U);

			/* Check for Context descriptor */
			/* Get current descriptor address */
			dmarxdesc = (ETH_DMADescTypeDef *)dmarxdesclist->RxDesc[desc_index];

			if(READ_BIT(dmarxdesc->DESC3,  ETH_DMARXNDESCWBF_OWN)  == (uint32_t)RESET)
			{
				/* If IEEE 1588 timestamp feature is enabled, the DMA stores the timestamp
				(if available). The DMA writes the context descriptor after the last
				descriptor for the current packet (in the next available descriptor). */
				if(READ_BIT(dmarxdesc->DESC3,  ETH_DMARXNDESCWBF_CTXT)  != (uint32_t)RESET)
				{
					/* Increment the number of descriptors to be passed to the application */
					dmarxdesclist->AppContextDesc = 1;
					/* Increment current rx descriptor index */
					INCR_RX_DESC_INDEX(desc_index, 1U);
				}
			}
			/* Fill information to Rx descriptors list */
			dmarxdesclist->CurRxDesc = desc_index;
			dmarxdesclist->FirstAppDesc = first_app_desc_index;
			dmarxdesclist->AppDescNbr = app_desc_count;

			/* Return function status */
			return 1;
		}
//		/* Check if first descriptor */
//		else if(READ_BIT(dmarxdesc->DESC3, ETH_DMARXNDESCWBF_FD) != (uint32_t)RESET)
//		{
//configASSERT( 1 == 0 );
//			first_app_desc_index = desc_index;
//			/* Increment the number of descriptors to be passed to the application */
//			app_desc_count = 1U;
//
//			/* Increment current rx descriptor index */
//			INCR_RX_DESC_INDEX(desc_index, 1U);
//			/* Get current descriptor address */
//			dmarxdesc = (ETH_DMADescTypeDef *)dmarxdesclist->RxDesc[desc_index];
//		}
//		/* It should be an intermediate descriptor */
//		else
//		{
//configASSERT( 1 == 0 );
//			/* Increment the number of descriptors to be passed to the application */
//			app_desc_count += 1U;
//
//			/* Increment current rx descriptor index */
//			INCR_RX_DESC_INDEX(desc_index, 1U);
//			/* Get current descriptor address */
//			dmarxdesc = (ETH_DMADescTypeDef *)dmarxdesclist->RxDesc[desc_index];
//		}
	}	/* while ( OWN == 0 ) */

	configASSERT( app_desc_count == 0 );

//	/* Build Descriptors if an incomplete Packet is received */
//	if(app_desc_count > 0U)
//	{
//		dmarxdesclist->CurRxDesc = desc_index;
//		dmarxdesclist->FirstAppDesc = first_app_desc_index;
//		desc_index = first_app_desc_index;
//		dmarxdesc = (ETH_DMADescTypeDef *)dmarxdesclist->RxDesc[desc_index];
//
//		for(desc_scan_count = 0; ipTRUE_BOOL; desc_scan_count++)
//		{
//			WRITE_REG(dmarxdesc->DESC0, dmarxdesc->BackupAddr0);
//			WRITE_REG(dmarxdesc->DESC3, ETH_DMARXNDESCRF_BUF1V);
//
//			if (READ_REG(dmarxdesc->BackupAddr1) != ((uint32_t)RESET))
//			{
//				WRITE_REG(dmarxdesc->DESC2, dmarxdesc->BackupAddr1);
//				SET_BIT(dmarxdesc->DESC3, ETH_DMARXNDESCRF_BUF2V);
//			}
//
//			SET_BIT(dmarxdesc->DESC3, ETH_DMARXNDESCRF_OWN);
//
//			if(dmarxdesclist->ItMode != ((uint32_t)RESET))
//			{
//				SET_BIT(dmarxdesc->DESC3, ETH_DMARXNDESCRF_IOC);
//			}
//			if(desc_scan_count >= (app_desc_count - 1U))
//			{
//				break;
//			}
//			/* Increment rx descriptor index */
//			INCR_RX_DESC_INDEX(desc_index, 1U);
//			/* Get descriptor address */
//			dmarxdesc = (ETH_DMADescTypeDef *)dmarxdesclist->RxDesc[desc_index];
//		}
//
//		/* Set the Tail pointer address to the last rx descriptor hold by the app */
//		WRITE_REG(heth->Instance->DMACRDTPR, (uint32_t)dmarxdesc);
//	}

	/* Fill information to Rx descriptors list: No received Packet */
	dmarxdesclist->AppDescNbr = 0U;

