FreeRTOS/FreeRTOS/FreeRTOS-Plus/Source/FreeRTOS-Plus-TCP/portable/NetworkInterface/STM32Hxx/stm32hxx_hal_eth.c
	return 0;
}

/**
  * @brief  This function gets the buffer address of last received Packet.
  * @note   Please insure to allocate the RxBuffer structure before calling this function
  *         how to use example:
  *           HAL_ETH_GetRxDataLength(heth, &Length);
  *           BuffersNbr = (Length / heth->Init.RxBuffLen) + 1;
  *           RxBuffer = (ETH_BufferTypeDef *)malloc(BuffersNbr * sizeof(ETH_BufferTypeDef));
  *           HAL_ETH_GetRxDataBuffer(heth, RxBuffer);
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @param  RxBuffer: Pointer to a ETH_BufferTypeDef structure
  * @retval HAL status
  */
size_t HAL_ETH_GetRxData(ETH_HandleTypeDef *heth, ETH_BufferTypeDef *RxBuffer)
{
	ETH_RxDescListTypeDef *dmarxdesclist = &( heth->RxDescList );
	uint32_t desc_index;
	uint32_t packet_length;
	__IO const ETH_DMADescTypeDef *dma_rx_desc;

	configASSERT( RxBuffer != NULL );

	if( HAL_ETH_IsRxDataAvailable(heth) == 0U )
	{
		/* No data to be transferred to the application */
		return 0U;
	}
	desc_index = dmarxdesclist->FirstAppDesc;
	dma_rx_desc = ( ETH_DMADescTypeDef * ) dmarxdesclist->RxDesc[ desc_index ];

	configASSERT( dmarxdesclist->AppDescNbr == 1 );

	/* last descriptor data length */
	packet_length = READ_BIT(dma_rx_desc->DESC3, ETH_DMARXNDESCWBF_PL);

	RxBuffer->buffer = ( uint8_t * ) dma_rx_desc->BackupAddr0;
	RxBuffer->len = packet_length;

	/* data is in only one buffer */
	configASSERT( packet_length <= heth->Init.RxBuffLen );

	return packet_length;
  }

///**
//  * @brief  This function gets the length of last received Packet.
//  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
//  *         the configuration information for ETHERNET module
//  * @param  Length: parameter to hold Rx packet length
//  * @retval HAL Status
//  */
//HAL_StatusTypeDef HAL_ETH_GetRxDataLength(ETH_HandleTypeDef *heth, uint32_t *Length)
//{
//	ETH_RxDescListTypeDef *dmarxdesclist = &heth->RxDescList;
//	uint32_t descidx = dmarxdesclist->FirstAppDesc;
//	__IO const ETH_DMADescTypeDef *dmarxdesc;
//
//	if(dmarxdesclist->AppDescNbr == 0U)
//	{
//		if(HAL_ETH_IsRxDataAvailable(heth) == 0U)
//		{
//			/* No data to be transferred to the application */
//			return HAL_ERROR;
//		}
//	}
//
//	/* Get index of last descriptor */
//	INCR_RX_DESC_INDEX(descidx, (dmarxdesclist->AppDescNbr - 1U));
//	/* Point to last descriptor */
//  dmarxdesc = (ETH_DMADescTypeDef *)dmarxdesclist->RxDesc[descidx];
//
//	*Length = READ_BIT(dmarxdesc->DESC3, ETH_DMARXNDESCWBF_PL);
//
//	return HAL_OK;
//}

/**
  * @brief  Get the Rx data info (Packet type, VLAN tag, Filters status, ...)
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @param  RxPacketInfo: parameter to hold info of received buffer
  * @retval HAL status
  */
//HAL_StatusTypeDef HAL_ETH_GetRxDataInfo(ETH_HandleTypeDef *heth, ETH_RxPacketInfo *RxPacketInfo)
//{
//  ETH_RxDescListTypeDef *dmarxdesclist = &heth->RxDescList;
//  uint32_t descidx = dmarxdesclist->FirstAppDesc;
//  __IO const ETH_DMADescTypeDef *dmarxdesc;
//
//  if(dmarxdesclist->AppDescNbr == 0U)
//  {
//    if(HAL_ETH_IsRxDataAvailable(heth) == 0U)
//  {
//      /* No data to be transferred to the application */
//      return HAL_ERROR;
//    }
//  }
//
//  /* Get index of last descriptor */
//  INCR_RX_DESC_INDEX(descidx, ((dmarxdesclist->AppDescNbr) - 1U));
//  /* Point to last descriptor */
//  dmarxdesc = (ETH_DMADescTypeDef *)dmarxdesclist->RxDesc[descidx];
//
//  if((dmarxdesc->DESC3 & ETH_DMARXNDESCWBF_ES) != (uint32_t)RESET)
//    {
//    RxPacketInfo->ErrorCode = READ_BIT(dmarxdesc->DESC3, ETH_DMARXNDESCWBF_ERRORS_MASK);
//    }
//    else
//    {
//    if(READ_BIT(dmarxdesc->DESC3, ETH_DMARXNDESCWBF_RS0V) != 0U)
//    {
//
//      if(READ_BIT(dmarxdesc->DESC3, ETH_DMARXNDESCWBF_LT) == ETH_DMARXNDESCWBF_LT_DVLAN)
//      {
//        RxPacketInfo->VlanTag = READ_BIT(dmarxdesc->DESC0, ETH_DMARXNDESCWBF_OVT);
//        RxPacketInfo->InnerVlanTag = READ_BIT(dmarxdesc->DESC0, ETH_DMARXNDESCWBF_IVT) >> 16;
//  }
//  else
//  {
//        RxPacketInfo->VlanTag = READ_BIT(dmarxdesc->DESC0, ETH_DMARXNDESCWBF_OVT);
//      }
//  }
//
//    if(READ_BIT(dmarxdesc->DESC3, ETH_DMARXNDESCWBF_RS1V) != 0U)
//  {
//    /* Get Payload type */
//      RxPacketInfo->PayloadType =READ_BIT( dmarxdesc->DESC1, ETH_DMARXNDESCWBF_PT);
//    /* Get Header type */
//      RxPacketInfo->HeaderType = READ_BIT(dmarxdesc->DESC1, (ETH_DMARXNDESCWBF_IPV4 | ETH_DMARXNDESCWBF_IPV6));
//    /* Get Checksum status */
//      RxPacketInfo->Checksum = READ_BIT(dmarxdesc->DESC1, (ETH_DMARXNDESCWBF_IPCE | ETH_DMARXNDESCWBF_IPCB | ETH_DMARXNDESCWBF_IPHE));
//  }
//
//    if(READ_BIT(dmarxdesc->DESC3, ETH_DMARXNDESCWBF_RS2V) != 0U)
//  {
//      RxPacketInfo->MacFilterStatus = READ_BIT(dmarxdesc->DESC2, (ETH_DMARXNDESCWBF_HF | ETH_DMARXNDESCWBF_DAF | ETH_DMARXNDESCWBF_SAF | ETH_DMARXNDESCWBF_VF));
//      RxPacketInfo->L3FilterStatus = READ_BIT(dmarxdesc->DESC2,  (ETH_DMARXNDESCWBF_L3FM | ETH_DMARXNDESCWBF_L3L4FM));
//      RxPacketInfo->L4FilterStatus = READ_BIT(dmarxdesc->DESC2, (ETH_DMARXNDESCWBF_L4FM | ETH_DMARXNDESCWBF_L3L4FM));
//  }
//  }
//
//  /* Get the segment count */
//  WRITE_REG(RxPacketInfo->SegmentCnt, dmarxdesclist->AppDescNbr);
//
//  return HAL_OK;
//}

/**
* @brief  This function gives back Rx Desc of the last received Packet
*         to the DMA, so ETH DMA will be able to use these descriptors
*         to receive next Packets.
*         It should be called after processing the received Packet.
* @param  heth: pointer to a ETH_HandleTypeDef structure that contains
*         the configuration information for ETHERNET module
* @retval HAL status.
*/
HAL_StatusTypeDef HAL_ETH_BuildRxDescriptors(ETH_HandleTypeDef *heth, uint8_t *pucNewBuffer)
{
ETH_RxDescListTypeDef *dmarxdesclist = &heth->RxDescList;
uint32_t desc_index = dmarxdesclist->FirstAppDesc;
__IO ETH_DMADescTypeDef *dmarxdesc = (ETH_DMADescTypeDef *)dmarxdesclist->RxDesc[desc_index];
uint32_t totalappdescnbr = dmarxdesclist->AppDescNbr;
uint32_t descscan;

