FreeRTOS/FreeRTOS/FreeRTOS-Plus/Source/FreeRTOS-Plus-TCP/portable/NetworkInterface/STM32Hxx/stm32hxx_hal_eth.c
	if(dmarxdesclist->AppDescNbr == 0U)
	{
		/* No Rx descriptors to build */
		return HAL_ERROR;
	}

	if(dmarxdesclist->AppContextDesc != 0U)
	{
		/* A context descriptor is available */
		totalappdescnbr += 1U;
	}

	for( descscan = 0; ipTRUE_BOOL; descscan++ )
	{
	uint32_t DESC3;
		uint8_t *pucBuffer;
		if( pucNewBuffer != NULL )
		{
			/* Earlier zero-copy RX only: buffer was passed to the application. */
			pucBuffer = pucNewBuffer;
			dmarxdesc->BackupAddr0 = ( uint32_t )pucNewBuffer;
		}
		else
		{
			/* Keep on using the same buffer as before. */
			pucBuffer = ( uint8_t * ) dmarxdesc->BackupAddr0;
		}
		WRITE_REG(dmarxdesc->DESC0, ( uint32_t ) pucBuffer);
		/* Buffer 1 Address Valid */

		DESC3 = READ_REG(dmarxdesc->DESC3);
		WRITE_REG(DESC3, ETH_DMARXNDESCRF_BUF1V);

//		BackupAddr1 is not used in FreeRTOS+TCP
//		if (READ_REG(dmarxdesc->BackupAddr1) != 0U)
//		{
//			WRITE_REG(dmarxdesc->DESC2, dmarxdesc->BackupAddr1);
//			SET_BIT(DESC3, ETH_DMARXNDESCRF_BUF2V);
//		}

		/* Should be the last change. */
/*		SET_BIT(DESC3, ETH_DMARXNDESCRF_OWN); */

		if(dmarxdesclist->ItMode != 0U)
		{
			/* Interrupt Enabled on Completion */
			SET_BIT(DESC3, ETH_DMARXNDESCRF_IOC);
		}

		/* Now all is ready.. */
		SET_BIT(DESC3, ETH_DMARXNDESCRF_OWN);

		WRITE_REG(dmarxdesc->DESC3, DESC3);

		__DSB();

		/* And read it back. */
		( void ) dmarxdesc->DESC3;

		if( descscan >= ( totalappdescnbr - 1U ) )
		{
			break;
		}
		/* Increment rx descriptor index */
		INCR_RX_DESC_INDEX(desc_index, 1U);
		/* Get descriptor address */
		dmarxdesc = (ETH_DMADescTypeDef *)dmarxdesclist->RxDesc[desc_index];
	}

	/* Set the Tail pointer address to the last rx descriptor hold by the app */
	WRITE_REG(heth->Instance->DMACRDTPR, (uint32_t)dmarxdesc);

	/* reset the Application desc number */
	dmarxdesclist->AppDescNbr = 0;

	/*  reset the application context descriptor */
	WRITE_REG(heth->RxDescList.AppContextDesc, 0);

	return HAL_OK;
}


/**
  * @brief  This function handles ETH interrupt request.
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @retval HAL status
  */
void HAL_ETH_IRQHandler(ETH_HandleTypeDef *heth)
{
	/* ETH interrupt. See heth->DMACSR for details.
	 */

	if (__HAL_ETH_DMA_GET_IT(heth, ETH_DMACSR_RI))
	{
		if(__HAL_ETH_DMA_GET_IT_SOURCE(heth, ETH_DMACIER_RIE))
		{
			#if (USE_HAL_ETH_REGISTER_CALLBACKS == 1)
			{
				/*Call registered Receive complete callback*/
				heth->RxCpltCallback(heth);
			}
			#else
			{
				/* Receive complete callback */
				HAL_ETH_RxCpltCallback(heth);
			}
			#endif  /* USE_HAL_ETH_REGISTER_CALLBACKS */

			/* Clear the Eth DMA Rx IT pending bits */
			__HAL_ETH_DMA_CLEAR_IT(heth, ETH_DMACSR_RI | ETH_DMACSR_NIS);
		}
	}

	/* Packet transmitted */
	if (__HAL_ETH_DMA_GET_IT(heth, ETH_DMACSR_TI))
	{
		if(__HAL_ETH_DMA_GET_IT_SOURCE(heth, ETH_DMACIER_TIE))
		{
			#if (USE_HAL_ETH_REGISTER_CALLBACKS == 1)
			{
				/*Call registered Transmit complete callback*/
				heth->TxCpltCallback(heth);
			}
			#else
			{
				/* Transfer complete callback */
				HAL_ETH_TxCpltCallback(heth);
			}
			#endif  /* USE_HAL_ETH_REGISTER_CALLBACKS */

			/* Clear the Eth DMA Tx IT pending bits */
			__HAL_ETH_DMA_CLEAR_IT(heth, ETH_DMACSR_TI | ETH_DMACSR_NIS);
		}
	}


	/* ETH DMA Error */
	if(__HAL_ETH_DMA_GET_IT(heth, ETH_DMACSR_AIS))
	{
		if(__HAL_ETH_DMA_GET_IT_SOURCE(heth, ETH_DMACIER_AIE))
		{
			heth->ErrorCode |= HAL_ETH_ERROR_DMA;

			/* if fatal bus error occured */
			if (__HAL_ETH_DMA_GET_IT(heth, ETH_DMACSR_FBE))
			{
				/* Get DMA error code  */
				heth->DMAErrorCode = READ_BIT(heth->Instance->DMACSR, (ETH_DMACSR_FBE | ETH_DMACSR_TPS | ETH_DMACSR_RPS));

				/* Disable all interrupts */
				__HAL_ETH_DMA_DISABLE_IT(heth, ETH_DMACIER_NIE | ETH_DMACIER_AIE);

				/* Set HAL state to ERROR */
				set_error_state(heth, HAL_ETH_STATE_ERROR);
			}
			else
			{
				/* Get DMA error status  */
				heth->DMAErrorCode = READ_BIT(heth->Instance->DMACSR, (ETH_DMACSR_CDE | ETH_DMACSR_ETI | ETH_DMACSR_RWT |
				ETH_DMACSR_RBU | ETH_DMACSR_AIS));

				/* Clear the interrupt summary flag */
				__HAL_ETH_DMA_CLEAR_IT(heth, (ETH_DMACSR_CDE | ETH_DMACSR_ETI | ETH_DMACSR_RWT |
				ETH_DMACSR_RBU | ETH_DMACSR_AIS));
			}
			#if (USE_HAL_ETH_REGISTER_CALLBACKS == 1)
			{
				/* Call registered DMA Error callback*/
				heth->DMAErrorCallback(heth);
			}
			#else
			{
				/* Ethernet DMA Error callback */
				HAL_ETH_DMAErrorCallback(heth);
			}
			#endif  /* USE_HAL_ETH_REGISTER_CALLBACKS */
		}
	}

	/* ETH MAC Error IT */
	if(__HAL_ETH_MAC_GET_IT(heth, (ETH_MACIER_RXSTSIE | ETH_MACIER_TXSTSIE)))
	{
		/* Get MAC Rx Tx status and clear Status register pending bit */
		heth->MACErrorCode = READ_REG(heth->Instance->MACRXTXSR);

		set_error_state(heth, HAL_ETH_STATE_ERROR);

		#if (USE_HAL_ETH_REGISTER_CALLBACKS == 1)
		{
			/* Call registered MAC Error callback*/
			heth->DMAErrorCallback(heth);
		}
		#else
		{
			/* Ethernet MAC Error callback */
			HAL_ETH_MACErrorCallback(heth);
		}
		#endif  /* USE_HAL_ETH_REGISTER_CALLBACKS */

		heth->MACErrorCode = (uint32_t)(0x0U);
	}

	/* ETH PMT IT */
	if(__HAL_ETH_MAC_GET_IT(heth, ETH_MAC_PMT_IT))
	{
		/* Get MAC Wake-up source and clear the status register pending bit */
		heth->MACWakeUpEvent = READ_BIT(heth->Instance->MACPCSR, (ETH_MACPCSR_RWKPRCVD | ETH_MACPCSR_MGKPRCVD));

		#if (USE_HAL_ETH_REGISTER_CALLBACKS == 1)
		{
			/* Call registered PMT callback*/
			heth->PMTCallback(heth);
		}
		#else
		{
			/* Ethernet PMT callback */
			HAL_ETH_PMTCallback(heth);
		}
		#endif  /* USE_HAL_ETH_REGISTER_CALLBACKS */

		heth->MACWakeUpEvent = (uint32_t)(0x0U);
	}

	/* ETH EEE IT */
	if(__HAL_ETH_MAC_GET_IT(heth, ETH_MAC_LPI_IT))
	{
		/* Get MAC LPI interrupt source and clear the status register pending bit */
		heth->MACLPIEvent = READ_BIT(heth->Instance->MACPCSR, 0x0000000FU);

		#if (USE_HAL_ETH_REGISTER_CALLBACKS == 1)
		{
			/* Call registered EEE callback*/
			heth->EEECallback(heth);
		}
		#else
		{
			/* Ethernet EEE callback */
			HAL_ETH_EEECallback(heth);
		}
		#endif  /* USE_HAL_ETH_REGISTER_CALLBACKS */

		heth->MACLPIEvent = (uint32_t)(0x0U);
	}

#if defined(DUAL_CORE)
	if (HAL_GetCurrentCPUID() == CM7_CPUID)
	{
		/* check ETH WAKEUP exti flag */
		if(__HAL_ETH_WAKEUP_EXTI_GET_FLAG(ETH_WAKEUP_EXTI_LINE) != (uint32_t)RESET)
		{
			/* Clear ETH WAKEUP Exti pending bit */
			__HAL_ETH_WAKEUP_EXTI_CLEAR_FLAG(ETH_WAKEUP_EXTI_LINE);
			#if (USE_HAL_ETH_REGISTER_CALLBACKS == 1)
			{
				/* Call registered WakeUp callback*/
				heth->WakeUpCallback(heth);
			}
			#else
			{
				/* ETH WAKEUP callback */
				HAL_ETH_WakeUpCallback(heth);
			}
			#endif
		}
	}
	else
	{
		/* check ETH WAKEUP exti flag */
		if(__HAL_ETH_WAKEUP_EXTID2_GET_FLAG(ETH_WAKEUP_EXTI_LINE) != (uint32_t)RESET)
		{
			/* Clear ETH WAKEUP Exti pending bit */
			__HAL_ETH_WAKEUP_EXTID2_CLEAR_FLAG(ETH_WAKEUP_EXTI_LINE);
			#if (USE_HAL_ETH_REGISTER_CALLBACKS == 1)
			{
				/* Call registered WakeUp callback*/
				heth->WakeUpCallback(heth);
			}
			#else
			{
				/* ETH WAKEUP callback */
				HAL_ETH_WakeUpCallback(heth);
			}
			#endif
		}
	}
#else	/* #if defined(DUAL_CORE) */
	/* check ETH WAKEUP exti flag */
	if(__HAL_ETH_WAKEUP_EXTI_GET_FLAG(ETH_WAKEUP_EXTI_LINE) != (uint32_t)RESET)
	{
		/* Clear ETH WAKEUP Exti pending bit */
		__HAL_ETH_WAKEUP_EXTI_CLEAR_FLAG(ETH_WAKEUP_EXTI_LINE);
	#if (USE_HAL_ETH_REGISTER_CALLBACKS == 1)
		{
			/* Call registered WakeUp callback*/
			heth->WakeUpCallback(heth);
		}
	#else
		{
			/* ETH WAKEUP callback */
			HAL_ETH_WakeUpCallback(heth);
		}
	#endif
	}
#endif	/* #if defined(DUAL_CORE) */
}

/**
  * @brief  Tx Transfer completed callbacks.
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @retval None
  */
__weak void HAL_ETH_TxCpltCallback(ETH_HandleTypeDef *heth)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(heth);
  /* NOTE : This function Should not be modified, when the callback is needed,
  the HAL_ETH_TxCpltCallback could be implemented in the user file
  */
}

/**
  * @brief  Rx Transfer completed callbacks.
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @retval None
  */
__weak void HAL_ETH_RxCpltCallback(ETH_HandleTypeDef *heth)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(heth);
  /* NOTE : This function Should not be modified, when the callback is needed,
  the HAL_ETH_RxCpltCallback could be implemented in the user file
  */
}

/**
  * @brief  Ethernet DMA transfer error callbacks
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @retval None
  */
__weak void HAL_ETH_DMAErrorCallback(ETH_HandleTypeDef *heth)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(heth);
  /* NOTE : This function Should not be modified, when the callback is needed,
  the HAL_ETH_DMAErrorCallback could be implemented in the user file
  */
}

/**
* @brief  Ethernet MAC transfer error callbacks
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @retval None
  */
__weak void HAL_ETH_MACErrorCallback(ETH_HandleTypeDef *heth)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(heth);
  /* NOTE : This function Should not be modified, when the callback is needed,
  the HAL_ETH_MACErrorCallback could be implemented in the user file
  */
}

/**
  * @brief  Ethernet Power Management module IT callback
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @retval None
  */
__weak void HAL_ETH_PMTCallback(ETH_HandleTypeDef *heth)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(heth);
  /* NOTE : This function Should not be modified, when the callback is needed,
  the HAL_ETH_PMTCallback could be implemented in the user file
  */
}

/**
  * @brief  Energy Efficient Etherent IT callback
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @retval None
  */
__weak void HAL_ETH_EEECallback(ETH_HandleTypeDef *heth)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(heth);
  /* NOTE : This function Should not be modified, when the callback is needed,
  the HAL_ETH_EEECallback could be implemented in the user file
  */
}

/**
  * @brief  ETH WAKEUP interrupt callback
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @retval None
  */
__weak void HAL_ETH_WakeUpCallback(ETH_HandleTypeDef *heth)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(heth);
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_ETH_WakeUpCallback could be implemented in the user file
   */
}

/**
  * @brief  Read a PHY register
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @param  PHYAddr: PHY port address, must be a value from 0 to 31
  * @param  PHYReg: PHY register address, must be a value from 0 to 31
  * @param pRegValue: parameter to hold read value
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ETH_ReadPHYRegister(ETH_HandleTypeDef *heth, uint32_t PHYAddr, uint32_t PHYReg, uint32_t *pRegValue)
{
  uint32_t tmpreg, tickstart;

