FreeRTOS/FreeRTOS/FreeRTOS-Plus/Source/FreeRTOS-Plus-TCP/portable/NetworkInterface/STM32Hxx/stm32hxx_hal_eth.c
	/* Get the ETHERNET MACMDIOAR value */
	tmpreg = (heth->Instance)->MACMDIOAR;

	/* Clear CSR Clock Range bits */
	tmpreg &= ~ETH_MACMDIOAR_CR;

	/* Get hclk frequency value */
	hclk = HAL_RCC_GetHCLKFreq();

	/* Set CR bits depending on hclk value */
	if((hclk >= 20000000U)&&(hclk < 35000000U))
	{
		/* CSR Clock Range between 20-35 MHz */
		tmpreg |= (uint32_t)ETH_MACMDIOAR_CR_DIV16;
	}
	else if((hclk >= 35000000U)&&(hclk < 60000000U))
	{
		/* CSR Clock Range between 35-60 MHz */
		tmpreg |= (uint32_t)ETH_MACMDIOAR_CR_DIV26;
	}
	else if((hclk >= 60000000U)&&(hclk < 100000000U))
	{
		/* CSR Clock Range between 60-100 MHz */
		tmpreg |= (uint32_t)ETH_MACMDIOAR_CR_DIV42;
	}
	else if((hclk >= 100000000U)&&(hclk < 150000000U))
	{
		/* CSR Clock Range between 100-150 MHz */
		tmpreg |= (uint32_t)ETH_MACMDIOAR_CR_DIV62;
	}
	else /* (hclk >= 150000000)&&(hclk <= 200000000) */
	{
		/* CSR Clock Range between 150-200 MHz */
		tmpreg |= (uint32_t)ETH_MACMDIOAR_CR_DIV102;
	}

	/* Configure the CSR Clock Range */
	(heth->Instance)->MACMDIOAR = (uint32_t)tmpreg;
}

/**
  * @brief  Initializes the DMA Tx descriptors.
  *         called by HAL_ETH_Init() API.
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @retval None
  */
static void ETH_DMATxDescListInit(ETH_HandleTypeDef *heth)
{
  ETH_DMADescTypeDef *dmatxdesc;
  uint32_t i;

  /* Fill each DMATxDesc descriptor with the right values */
  for(i=0; i < (uint32_t)ETH_TX_DESC_CNT; i++)
  {
    dmatxdesc = heth->Init.TxDesc + i;

    WRITE_REG(dmatxdesc->DESC0, 0x0);
    WRITE_REG(dmatxdesc->DESC1, 0x0);
    WRITE_REG(dmatxdesc->DESC2, 0x0);
    WRITE_REG(dmatxdesc->DESC3, 0x0);

    WRITE_REG(heth->TxDescList.TxDesc[i], (uint32_t)dmatxdesc);
  }

  heth->TxDescList.CurTxDesc = 0;
  heth->TxDescList.TailTxDesc = 0;

  /* Set Transmit Descriptor Ring Length */
  WRITE_REG(heth->Instance->DMACTDRLR, (ETH_TX_DESC_CNT -1));

  /* Set Transmit Descriptor List Address */
  /* Channel Tx descriptor list address register (ETH_DMACTXDLAR)). */
  WRITE_REG(heth->Instance->DMACTDLAR, (uint32_t) heth->Init.TxDesc);

  /* Set Transmit Descriptor Tail pointer */
  WRITE_REG(heth->Instance->DMACTDTPR, (uint32_t) heth->Init.TxDesc);
}

/**
  * @brief  Initializes the DMA Rx descriptors in chain mode.
  *         called by HAL_ETH_Init() API.
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @retval None
  */
static void ETH_DMARxDescListInit(ETH_HandleTypeDef *heth)
{
  ETH_DMADescTypeDef *dmarxdesc;
  uint32_t i;

  for(i = 0; i < (uint32_t)ETH_RX_DESC_CNT; i++)
  {
    dmarxdesc =  heth->Init.RxDesc + i;

    WRITE_REG(dmarxdesc->DESC0, 0x0);
    WRITE_REG(dmarxdesc->DESC1, 0x0);
    WRITE_REG(dmarxdesc->DESC2, 0x0);
    WRITE_REG(dmarxdesc->DESC3, 0x0);
    WRITE_REG(dmarxdesc->BackupAddr0, 0x0);
    WRITE_REG(dmarxdesc->BackupAddr1, 0x0);

    /* Set Rx descritors adresses */
    WRITE_REG(heth->RxDescList.RxDesc[i], (uint32_t)dmarxdesc);
  }

  WRITE_REG(heth->RxDescList.CurRxDesc, 0);
  WRITE_REG(heth->RxDescList.FirstAppDesc, 0);
  WRITE_REG(heth->RxDescList.AppDescNbr, 0);
  WRITE_REG(heth->RxDescList.ItMode, 0);
  WRITE_REG(heth->RxDescList.AppContextDesc, 0);

  /* Set Receive Descriptor Ring Length */
  WRITE_REG(heth->Instance->DMACRDRLR, ( uint32_t ) ( ETH_RX_DESC_CNT - 1 ) );

  /* Set Receive Descriptor List Address */
  /* Channel Rx descriptor list address register (ETH_DMACRXDLAR)). */
  WRITE_REG(heth->Instance->DMACRDLAR, (uint32_t) heth->Init.RxDesc);

  /* Set Receive Descriptor Tail pointer Address */
  WRITE_REG(heth->Instance->DMACRDTPR, ((uint32_t)(heth->Init.RxDesc + (uint32_t)(ETH_RX_DESC_CNT - 1))));
}

void ETH_Clear_Tx_Descriptors(ETH_HandleTypeDef *heth)
{
	uint32_t ulTailTxDesc = heth->TxDescList.TailTxDesc;

	while( ( uxSemaphoreGetCount( xTXDescriptorSemaphore ) ) != ETH_TX_DESC_CNT )
	{
	ETH_DMADescTypeDef *xDMATxDescriptor = (ETH_DMADescTypeDef *)heth->TxDescList.TxDesc[ ulTailTxDesc ];

		if( ( xDMATxDescriptor->DESC3 & ETH_DMATXNDESCRF_OWN ) != 0 )
		{
			/* No buffer is assigned or DMA still OWNs this descriptor. */
			break;
		}
		#if( ipconfigZERO_COPY_TX_DRIVER != 0 )
		{
		NetworkBufferDescriptor_t *pxNetworkBuffer;
		uint8_t *ucPayLoad;

			ucPayLoad = ( uint8_t * ) xDMATxDescriptor->DESC0;
			if( ucPayLoad == NULL )
			{
				/* No buffer is assigned or DMA still OWNs this descriptor. */
				break;
			}

			pxNetworkBuffer = pxPacketBuffer_to_NetworkBuffer( ucPayLoad );
			if( pxNetworkBuffer != NULL )
			{
				vReleaseNetworkBufferAndDescriptor( pxNetworkBuffer ) ;
			}
		}
		#endif

		xDMATxDescriptor->DESC0 = ( uint32_t )0u;

		INCR_TX_DESC_INDEX( ulTailTxDesc, 1U );
		heth->TxDescList.TailTxDesc = ulTailTxDesc;

		__DSB();

		xSemaphoreGive( xTXDescriptorSemaphore );
	}
}
/**
  * @brief  Prepare Tx DMA descriptor before transmission.
  *         called by HAL_ETH_Transmit_IT and HAL_ETH_Transmit_IT() API.
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @param  pTxConfig: Tx packet configuration
  * @param  ItMode: Enable or disable Tx EOT interrept
  * @retval Status
  */
static uint32_t ETH_Prepare_Tx_Descriptors(ETH_HandleTypeDef *heth, ETH_TxPacketConfig *pTxConfig, uint32_t ItMode)
{
	ETH_TxDescListTypeDef *dmatxdesclist = &heth->TxDescList;
	uint32_t firstdescidx = dmatxdesclist->CurTxDesc;
	uint32_t DESC3;
	ETH_DMADescTypeDef *dmatxdesc = (ETH_DMADescTypeDef *)dmatxdesclist->TxDesc[firstdescidx];
	ETH_BufferTypeDef  *txbuffer = pTxConfig->TxBuffer;

	/* FreeRTOS+TCP doesn't support linked buffers. */
	txbuffer->next = NULL;
	DESC3 = READ_REG(dmatxdesc->DESC3);

	/* Current TX Descriptor Owned by DMA: cannot be used by the application  */
	if(READ_BIT(DESC3, ETH_DMATXNDESCWBF_OWN) != 0U)
	{
		/* Should not get here because TX descriptors are protected by a counting semaphore. */
		return HAL_ETH_ERROR_BUSY;
	}

	/***************************************************************************/
	/*****************    Normal descriptors configuration     *****************/
	/***************************************************************************/

	/* Set header or buffer 1 address */
	WRITE_REG(dmatxdesc->DESC0, (uint32_t)txbuffer->buffer);
	/* Set header or buffer 1 Length */
	MODIFY_REG(dmatxdesc->DESC2, ETH_DMATXNDESCRF_B1L, txbuffer->len);

	WRITE_REG(dmatxdesc->DESC1, 0x0);
	/* Set buffer 2 Length to zero */
	MODIFY_REG(dmatxdesc->DESC2, ETH_DMATXNDESCRF_B2L, 0x0U);

