FreeRTOS/FreeRTOS/FreeRTOS-Plus/Source/FreeRTOS-Plus-TCP/portable/NetworkInterface/STM32Hxx/stm32hxx_hal_eth.c
	MODIFY_REG(DESC3, ETH_DMATXNDESCRF_FL, pTxConfig->Length);

	if(READ_BIT(pTxConfig->Attributes, ETH_TX_PACKETS_FEATURES_CSUM) != 0U)
	{
		MODIFY_REG(DESC3, ETH_DMATXNDESCRF_CIC, pTxConfig->ChecksumCtrl);
	}

	if(READ_BIT(pTxConfig->Attributes, ETH_TX_PACKETS_FEATURES_CRCPAD) != 0U)
	{
		MODIFY_REG(DESC3, ETH_DMATXNDESCRF_CPC, pTxConfig->CRCPadCtrl);
	}

	/* Mark it as First and the last Descriptor */
	SET_BIT(DESC3, ETH_DMATXNDESCRF_FD | ETH_DMATXNDESCRF_LD );

	/* Mark it as NORMAL descriptor */
	CLEAR_BIT(DESC3, ETH_DMATXNDESCRF_CTXT);

	/* set OWN bit of FIRST descriptor */
	SET_BIT(DESC3, ETH_DMATXNDESCRF_OWN);

	if(ItMode != ((uint32_t)RESET))
	{
		/* Set Interrupt on competition bit */
		SET_BIT(dmatxdesc->DESC2, ETH_DMATXNDESCRF_IOC);
	}
	else
	{
		/* Clear Interrupt on competition bit */
		CLEAR_BIT(dmatxdesc->DESC2, ETH_DMATXNDESCRF_IOC);
	}

	WRITE_REG(dmatxdesc->DESC3, DESC3);
	/* Read back the value. */
	if( READ_REG(dmatxdesc->DESC3)) {}

	__DSB();

	/* Return function status */
	return HAL_ETH_ERROR_NONE;
}

#if (USE_HAL_ETH_REGISTER_CALLBACKS == 1)
static void ETH_InitCallbacksToDefault(ETH_HandleTypeDef *heth)
{
  /* Init the ETH Callback settings */
  heth->TxCpltCallback   = HAL_ETH_TxCpltCallback;    /* Legacy weak TxCpltCallback   */
  heth->RxCpltCallback   = HAL_ETH_RxCpltCallback;    /* Legacy weak RxCpltCallback   */
  heth->DMAErrorCallback = HAL_ETH_DMAErrorCallback;  /* Legacy weak DMAErrorCallback */
  heth->MACErrorCallback = HAL_ETH_MACErrorCallback;  /* Legacy weak MACErrorCallback */
  heth->PMTCallback      = HAL_ETH_PMTCallback;       /* Legacy weak PMTCallback      */
  heth->EEECallback      = HAL_ETH_EEECallback;       /* Legacy weak EEECallback      */
  heth->WakeUpCallback   = HAL_ETH_WakeUpCallback;    /* Legacy weak WakeUpCallback   */
}
#endif /* USE_HAL_ETH_REGISTER_CALLBACKS */

/**
  * @}
  */

/**
  * @}
  */

#endif /* ETH */

#endif /* HAL_ETH_MODULE_ENABLED */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
